<template>
    <div class="vue-select-city">
        <select class="select" name="province" v-model="province">
            <option value="-1">省/直辖市</option>
            <option :value="province.name" v-for="province of provinces">{{province.name}}</option>
        </select>
        <select class="select" name="city" v-model="city">
            <option :value="city" v-for="city of cities">{{city}}</option>
        </select>
    </div>
</template>

<script>
    var data = [
        {
            name: "北京市",
            cities: [ "西城区", "东城区", "崇文区", "宣武区", "朝阳区", "海淀区", "丰台区", "石景山区", "门头沟区", "房山区", "通州区", "顺义区", "大兴区", "昌平区", "平谷区", "怀柔区", "密云县", "延庆县" ]
        },
        {
            name: "天津市",
            cities: [ "和平区", "河东区", "河西区", "南开区", "河北区", "红桥区", "塘沽区", "汉沽区", "大港区", "东丽区", "西青区", "北辰区", "津南区", "武清区", "宝坻区", "静海县", "宁河县", "蓟县", "开发区" ]
        },
        { name: "河北省", cities: [ "石家庄市", "秦皇岛市", "廊坊市", "保定市", "邯郸市", "唐山市", "邢台市", "衡水市", "张家口市", "承德市", "沧州市" ] },
        { name: "山西省", cities: [ "太原市", "大同市", "长治市", "晋中市", "阳泉市", "朔州市", "运城市", "临汾市", "晋城市", "忻州市", "吕梁市" ] },
        { name: "内蒙古", cities: [ "呼和浩特市", "鄂尔多斯市", "乌海市", "赤峰市", "通辽市", "呼伦贝尔市", "巴彦淖尔市", "乌兰察布市", "锡林郭勒盟", "兴安盟", "阿拉善盟", "包头市" ] },
        { name: "辽宁省", cities: [ "大连市", "沈阳市", "鞍山市", "抚顺市", "营口市", "锦州市", "丹东市", "朝阳市", "辽阳市", "阜新市", "铁岭市", "盘锦市", "本溪市", "葫芦岛市" ] },
        { name: "吉林省", cities: [ "长春市", "吉林市", "四平市", "辽源市", "通化市", "延吉", "白城市", "白山市", "松原市", "延边州" ] },
        { name: "黑龙江", cities: [ "哈尔滨市", "齐齐哈尔市", "鸡西市", "双鸭山市", "大庆市", "伊春市", "牡丹江市", "鹤岗市", "佳木斯市", "七台河市", "绥化市", "黑河市", "大兴安岭地区" ] },
        {
            name: "上海市",
            cities: [ "黄浦区", "杨浦区", "徐汇区", "静安区", "卢湾区", "普陀区", "闸北区", "虹口区", "长宁区", "宝山区", "闵行区", "嘉定区", "浦东新区", "金山区", "松江区", "青浦区", "崇明县", "奉贤区", "南汇区" ]
        },
        { name: "江苏省", cities: [ "南京市", "苏州市", "无锡市", "常州市", "扬州市", "徐州市", "南通市", "镇江市", "泰州市", "淮安市", "连云港市", "宿迁市", "盐城市" ] },
        { name: "浙江省", cities: [ "杭州市", "金华市", "宁波市", "温州市", "嘉兴市", "绍兴市", "丽水市", "湖州市", "台州市", "舟山市", "衢州市" ] },
        { name: "安徽省", cities: [ "合肥市", "马鞍山市", "蚌埠市", "黄山市", "芜湖市", "淮南市", "淮北市", "铜陵市", "阜阳市", "宣城市", "安庆市", "滁州市", "宿州市", "巢湖市", "六安市", "亳州市", "池州市" ] },
        { name: "福建省", cities: [ "福州市", "厦门市", "泉州市", "漳州市", "南平市", "龙岩市", "莆田市", "三明市", "宁德市" ] },
        { name: "江西省", cities: [ "南昌市", "景德镇市", "抚州市", "上饶市", "萍乡市", "九江市", "吉安市", "宜春市", "鹰潭市", "新余市", "赣州市" ] },
        { name: "山东省", cities: [ "青岛市", "济南市", "淄博市", "烟台市", "泰安市", "临沂市", "日照市", "莱芜市", "德州市", "威海市", "东营市", "荷泽市", "济宁市", "潍坊市", "枣庄市", "聊城市", "滨州市" ] },
        {
            name: "河南省",
            cities: [ "郑州市", "洛阳市", "开封市", "平顶山市", "濮阳市", "安阳市", "鹤壁市", "许昌市", "漯河市", "南阳市", "信阳市", "周口市", "新乡市", "焦作市", "三门峡市", "商丘市", "驻马店市" ]
        },
        { name: "湖北省", cities: [ "武汉市", "襄樊市", "孝感市", "十堰市", "荆州市", "黄石市", "宜昌市", "黄冈市", "恩施州", "鄂州市", "荆门市", "随州市", "咸宁市" ] },
        { name: "湖南省", cities: [ "长沙市", "湘潭市", "岳阳市", "株洲市", "怀化市", "永州市", "益阳市", "张家界市", "常德市", "衡阳市", "湘西州", "邵阳市", "娄底市", "郴州市" ] },
        {
            name: "广东省",
            cities: [ "广州市", "深圳市", "东莞市", "佛山市", "珠海市", "汕头市", "韶关市", "江门市", "梅州市", "揭阳市", "中山市", "河源市", "惠州市", "茂名市", "湛江市", "阳江市", "潮州市", "云浮市", "汕尾市", "肇庆市", "大岭山镇", "常平镇", "清远市" ]
        },
        { name: "广西", cities: [ "南宁市", "桂林市", "柳州市", "梧州市", "北海市", "防城港市", "钦州市", "来宾市", "贵港市", "玉林市", "贺州市", "百色市", "河池市", "崇左市" ] },
        { name: "海南省", cities: [ "海口市", "三亚市" ] },
        {
            name: "重庆市",
            cities: [ "渝中区", "大渡口区", "江北区", "沙坪坝区", "九龙坡区", "南岸区", "北碚区", "万盛区", "双桥区", "渝北区", "巴南区", "万州区", "涪陵区", "黔江区", "长寿区", "綦江县", "潼南县", "铜梁县", "大足县", "荣昌县", "璧山县", "梁平县", "城口县", "丰都县", "垫江县", "武隆县", "忠县", "开县", "云阳县", "奉节县", "巫山县", "巫溪县", "石柱县", "秀山县", "酉阳县", "彭水县", "江津市", "合川市", "永川市", "南川市" ]
        },
        {
            name: "四川省",
            cities: [ "成都市", "泸州市", "达州市", "南充市", "乐山市", "绵阳市", "广元市", "德阳市", "内江市", "遂宁市", "宜宾市", "眉山市", "雅安市", "巴中市", "自贡市", "攀枝花市", "资阳市", "广安市", "阿坝州", "甘孜州", "凉山州" ]
        },
        { name: "贵州省", cities: [ "贵阳市", "六盘水市", "遵义市", "安顺市", "铜仁地区", "黔西南州", "毕节地区", "黔东南州", "黔南州" ] },
        { name: "云南省", cities: [ "昆明市", "曲靖市", "保山市", "丽江市", "昭通市", "玉溪市", "临沧市", "思茅市", "文山州", "红河州", "楚雄市", "西双版纳州", "大理州", "德宏州", "怒江州", "迪庆州" ] },
        { name: "西藏", cities: [ "拉萨市", "林芝地区", "日喀则地区", "昌都地区", "山南地区", "那曲地区", "阿里地区" ] },
        { name: "陕西省", cities: [ "西安市", "咸阳市", "延安市", "汉中市", "榆林市", "宝鸡市", "铜川市", "渭南市", "安康市", "商洛市" ] },
        { name: "甘肃省", cities: [ "兰州市", "金昌市", "嘉峪关市", "天水市", "武威市", "张掖市", "平凉市", "酒泉市", "庆阳市", "定西市", "陇南市", "临夏州", "甘南州" ] },
        { name: "青海省", cities: [ "黄南州", "海南州", "西宁市", "海东地区", "海西州", "海北州", "果洛州", "玉树州" ] },
        { name: "宁夏", cities: [ "银川市", "石嘴山市", "吴忠市", "固原市", "中卫市" ] },
        { name: "新疆", cities: [ "乌鲁木齐市", "哈密地区", "喀什地区", "和田地区", "巴音郭楞州", "昌吉州", "伊犁州", "塔城地区", "阿勒泰地区", "克拉玛依市", "博尔塔拉州", "阿克苏地区", "克孜勒苏柯尔克孜州" ] },
        { name: "香港", cities: [ "九龙", "新界", "香港岛" ] },
        { name: "澳门", cities: [ "澳门半岛", "澳门离岛市" ] },
        {
            name: "台湾省",
            cities: [ "台北市", "台北县市", "台东县", "台中市", "台中县市", "高雄市", "高雄县市", "新竹市", "新竹县", "宜兰县", "桃园县", "云林县", "彰化县", "台南市", "台南县市", "连江县市", "嘉义市", "基隆市", "花莲县", "嘉义县", "金门县", "苗栗县", "南投县", "澎湖县", "屏东县" ]
        }
    ];
    export default {
        data () {
            return {
                provinces: data,
                cities: [],
                province: this.currentProvince,
                city: this.currentCity
            }
        },
        computed: {
            cities () {
                if ( this.province == -1 ) {
                    return [ '先选择省' ];
                } else {
                    for ( let i = 0; i < this.provinces.length; i++ ) {
                        if ( this.provinces[ i ].name === this.province ) {
                            return this.provinces[ i ].cities;
                        }
                    }
                }
            }
        },
        props: {
            currentProvince: {
                type: String,
                default: "-1"
            },
            currentCity: {
                type: String,
                default: "先选择省"
            }
        },
        watch: {
            currentProvince ( val ) {
                this.province = val;
            },
            currentCity ( val ) {
                setTimeout( () => this.city = val, 10 );
            },
            province ( val ) {
                this.city = this.cities[ 0 ];
                this.$emit( 'updateProvince', val );
            },
            city ( val ) {
                this.$emit( 'updateCity', val );
            }
        }
    }
</script>
